-- phpMyAdmin SQL Dump
-- version 4.8.5
-- https://www.phpmyadmin.net/
--
-- Хост: localhost:3306
-- Время создания: Сен 20 2019 г., 14:52
-- Версия сервера: 5.7.24-27
-- Версия PHP: 7.2.7

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `u0701138_sto`
--

-- --------------------------------------------------------

--
-- Структура таблицы `clients`
--

CREATE TABLE `clients` (
  `id` int(11) NOT NULL,
  `name` varchar(250) NOT NULL DEFAULT '',
  `contact` text NOT NULL,
  `car_mark` varchar(100) NOT NULL DEFAULT '',
  `car_num` varchar(100) NOT NULL DEFAULT ''
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `clients`
--

INSERT INTO `clients` (`id`, `name`, `contact`, `car_mark`, `car_num`) VALUES
(4, 'Олег Возненко', '+38-093-756-03-32', 'Мазда 626', 'АЕ7225IР'),
(5, 'Володя ', '+380955210976', 'ваз2121', '087-25АЕ'),
(6, 'Артем ', '067-879-4813', ' FORD  SIERRA', 'АЕ2542IT'),
(7, 'Сафуан', '073-328-6819', ' ALFA ROMEO | 147 ', 'литовская'),
(8, 'Константин ', '066-607-7865', ' RENAULT | LAGUNA II ', 'плоский '),
(9, 'Артур', '095-861-5558', ' OPEL | VECTRA A', 'АЕ2373'),
(10, '111', '00000000', 'ваз 2109', 'АЕ'),
(11, 'Даниил', '066-306-7312', 'Ваз 2109', 'АЕ5136ВК'),
(12, 'Виталик', '098-061-7133', 'ВАЗ 2121', 'АЕ7626IT'),
(13, 'Владимер', '073-066-6382', 'DAEWOO MATIZ', 'АЕ2337IK'),
(14, 'Виктор Петрович ', '098-651-7043', ' CHEVROLET  LACETTI', 'АЕ0603НВ'),
(15, 'Виктория', '098-129-0275', ' AUDI | A2', 'KR3AF43'),
(16, 'Алексей', '098-508-0442\r\n', 'RENAULT | LAGUNA', 'АН3096ЕН'),
(17, 'Дмитри', '050-196-1190', 'ваз2101', '447-91АН'),
(18, 'Андрей ', '066-957-7128', 'GEELY | EMGRAND EC7', 'AE5824HO'),
(19, 'Кингсли', '063-656-1407\r\nJMZGG12R231156703', 'мазда 6 ', 'GRS 037'),
(20, 'Роман', '+380638975589', 'ВАЗ 2101', 'AE 6326 IA'),
(21, 'Александр', '050 139 17 54', ' FORD  ESCORT', 'AE 2154 HI'),
(22, 'Усман', '066 447 34 33', 'VAZ 2110', 'AE 1848 CX'),
(23, 'Чингиз', '066 607 1085', 'Mersedes T1', 'AE 2273 AM'),
(24, 'Влад', '095 780 62 37', 'Лада Приора', 'АЕ6279IН'),
(25, 'Васильчик Александр', '098 005 90 50', ' FORD  SIERRA', 'AR 6798 AO'),
(27, 'Евгений', '063 381 14 93', 'Нива 2121', 'BI 6771 BO'),
(28, 'Юрий', '0980779500', 'Славута', 'AA 3442 OP'),
(29, 'Виталий', '0975202033', 'OPEL', 'AE 7313 KC'),
(32, 'Юра Волнухин', '0975437170 YV1LS5102R2146351', 'Volvo', 'AE 7316 IH '),
(33, 'Дима', '0665176660  KL1NA193E4K055908', 'Chevrolet LACETTI', 'AE 2555 BH'),
(34, 'Эмануэль', '+380730383736  WF0AXXGBBAVU03411', 'FORD Mondeo', 'RJA 45865'),
(35, 'Андрей', '0992262830  WDF63960113007908', 'Mersedes Vito', ''),
(38, 'Иван Петрович', 'JN1TBNT31U0302376', 'NISSAN X-TRAIL', 'AE 8346 HH'),
(39, 'Дмитрий', '050 196 11 90', ' VAZ 2101', '447 91 AH'),
(40, 'Владимир', '0501929761', 'VAZ 2113', ''),
(41, 'Паша,Андрей', '0991351092, 0959329552(ЖЕНА)', 'VW', '');

-- --------------------------------------------------------

--
-- Структура таблицы `employee`
--

CREATE TABLE `employee` (
  `id` int(1) NOT NULL,
  `name` varchar(250) NOT NULL DEFAULT '',
  `contact` text NOT NULL,
  `description` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `employee`
--

INSERT INTO `employee` (`id`, `name`, `contact`, `description`) VALUES
(4, 'Юра Волнухин', '097-543-7170', ''),
(5, 'Ваган Исраелян', '066-047-5181', ''),
(6, 'Кулин Генади', '063-144-3423', ''),
(8, 'Дмитрий Долгополов', '050 294 43 02', '');

-- --------------------------------------------------------

--
-- Структура таблицы `report`
--

CREATE TABLE `report` (
  `id` int(11) NOT NULL,
  `writer` varchar(250) NOT NULL DEFAULT '',
  `date` varchar(20) NOT NULL DEFAULT '',
  `description` text NOT NULL,
  `cost` double NOT NULL DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `report`
--

INSERT INTO `report` (`id`, `writer`, `date`, `description`, `cost`) VALUES
(1, '<a href=\"/work/more/1\">Работа #1</a>', '2018-11-22', 'Det 1(d0001) 10 по 170 = 1700; gooood = 332; Det 1(d0001) 100 по 170 = 17000; ', 19032),
(2, 'Levin', '2018-11-08', 'example', -250),
(3, '<a href=\"/work/more/3\">Работа #3</a>', '2018-11-24', 'Det 1(d0001) 1 по 170 = 170; замена шрус. = 700; ', 870),
(5, '2018-11-24', 'kofe', 'gjhgj', -100),
(6, '<a href=\"/work/more/4\">Работа #4</a>', '2018-11-24', 'зам. рычагов, шаравые, ступицп пра., колодки, масла 10W40. = 1000; Det 1(d0001) 4 по 170 = 680; name123(x123123) 10 по 29 = 290; Det 1(d0001)  по 170 = 0; ', 1970),
(7, '<a href=\"/work/more/5\">Работа #5</a>', '2018-11-28', 'комплект диск сц.(MCM MK9062) 1 по 1400 = 1400; Цилиндр сцепл. главн(7709GH) 1 по 500 = 500; замена главнова цлиндра сц.\r\nзамена комплект диск сц. = 1500; ', 3400),
(8, '<a href=\"/work/more/6\">Работа #6</a>', '2018-11-28', 'замена антифриза, замена термостата  = 400; ', 400),
(9, '2018-11-30', 'за Аренду СТО', 'Андраник', -2000),
(10, '2018-11-30', 'обнуление кассы ', 'Андраник', -23322),
(11, '<a href=\"/work/more/8\">Работа #8</a>', '2018-11-30', 'замена глв.цлин.сц = 750; ', 750),
(12, '<a href=\"/work/more/10\">Работа #10</a>', '2018-11-30', 'очистка газамасленога канала = 300; ', 300),
(13, '<a href=\"/work/more/7\">Работа #7</a>', '2018-11-30', '10w40(масло) 5 по 94 = 470; Фильтр масляный(WL7083) 1 по 120 = 120; Фильтр масляный(WL7083) 1 по 120 = 120; замена свеч, катушки зажг.,масла = 450; Свеча зажигания (0242040502) 8 по 200 = 1600; катушка = 900; ', 3660),
(14, '2018-11-30', 'з/п Саша', 'Андраник', -600),
(15, '<a href=\"/work/more/9\">Работа #9</a>', '2018-11-30', 'система подачи тоалива = 300; ', 300),
(16, '2018-11-30', 'зарплата Юра\r\n', 'Андраник', 150),
(17, '2018-11-30', 'зарплата Вагану', 'Андраник', 1200),
(18, '2018-11-30', 'снял кассу', 'Андраник', -5760),
(19, '2018-11-30', 'снял кассу', 'Андраник', -5760),
(20, '<a href=\"/work/more/11\">Работа #11</a>', '2018-12-05', '10w40(масло) 4 по 94 = 376; Дорожная карта(Фильтр масляный) 1 по 100 = 100; ', 476),
(21, '<a href=\"/work/more/12\">Работа #12</a>', '2018-12-07', 'Фильтр топл.  (WF8333) 1 по 155 = 155; Фильтр масляный(W610/3) 1 по 190 = 190; замена масла, замена топленого фильтра, замена прокладки глуш. = 350; ', 695),
(22, '<a href=\"/work/more/14\">Работа #14</a>', '2018-12-12', 'дворник, аварика,  = ;  = 800;  = 800; ', 1600),
(23, '<a href=\"/work/more/15\">Работа #15</a>', '2018-12-12', 'замена сцпл. + салники каробки = 1200; ', 1200),
(24, '<a href=\"/work/more/17\">Работа #17</a>', '2018-12-18', '5w40(масло) 4 по 260 = 1040; Фильтр воздушный (FA 1729) 1 по 120 = 120; Фильтр масляный(OC534) 1 по 196 = 196;  = ; ', 1356),
(25, '<a href=\"/work/more/13\">Работа #13</a>', '2018-12-17', 'ремонт бампера  = ;  = 2500;  = ;  = ; ', 2500),
(26, '<a href=\"/work/more/19\">Работа #19</a>', '2019-01-08', 'Замена масла МКПП, замена масла двигателя = ; ', 0);

-- --------------------------------------------------------

--
-- Структура таблицы `stock`
--

CREATE TABLE `stock` (
  `id` int(11) NOT NULL,
  `mark` varchar(250) NOT NULL DEFAULT '',
  `name` varchar(250) NOT NULL DEFAULT '',
  `provider` varchar(250) NOT NULL DEFAULT '',
  `type_car` varchar(250) NOT NULL DEFAULT '',
  `count` varchar(11) NOT NULL DEFAULT '0',
  `cost` varchar(11) NOT NULL DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `stock`
--

INSERT INTO `stock` (`id`, `mark`, `name`, `provider`, `type_car`, `count`, `cost`) VALUES
(4, 'масло', ' 10w40', 'MATUL', 'бензи.,дизел., Д.В.С.', '20', '165'),
(6, 'масло', '10w40', 'Лукойл', 'бензи.,дизел., Д.В.С.', '135', '94'),
(7, 'масло', '80w90', 'Лукойл', 'трансмиссия ', '8', '165'),
(8, 'Ремень приводной клиновой ', '13+850', 'BOSCH', 'DAEWOO LANOS', '1', '147'),
(9, 'Ремень поликлин', '5PK1013 ', 'Gates', 'DAEWOO ESPERO, LANOS (пр-во Gates)', '1', '176'),
(10, 'Ремень поликлин', '6PK1870 ', 'Dongil', '  HYUNDAI', '1', '322'),
(11, 'ANTIFREEZE', 'G12+ 4L', 'E-TEK*CONCETRATE*', '', '20', '520'),
(12, 'Фильтр масляный', 'Дорожная карта', 'Дорожная карта', 'ВАЗ 2101-07, ГАЗ дв.406', '1', '100'),
(13, 'Код по каталогу:	DK7129', 'Фильтр масляный ', 'Дорожная карта', 'DAEWOO LANOS, NEXIA, CHEVROLET AVEO, LACETTI &lt;ДК&gt;', '1', '75'),
(14, 'Код по каталогу:	OC90', 'Фильтр масляный', 'KNECHT (MAHLE)', 'LANOS, AVEO, LACETTI, NUBIRA, NEXIA ', '3', '147'),
(15, 'avx10x850', 'сервисный ремень', 'continental', 'подбор авто', '2', '100'),
(16, 'RD.1340WA6250', 'Фильтр воздушный', 'RIDER', ' DAEWOO LANOS ', '1', '99'),
(17, 'wa6168', 'Фильтр воздушный ', 'WIX FILTERS', 'AUDI, LADA 2108-09', '2', '120'),
(18, '1457433963', 'Фильтр воздушный ', 'BOSCH', 'DAEWOO LANOS 97', '1', '219'),
(19, '1737854190', 'Провод зажигания ВАЗ 2108-09 силикон компл.', 'Дорожная карта', 'ВАЗ 2108-09', '1', '199'),
(20, '1737854188', 'Провод зажигания ВАЗ 2101-07 силикон компл.', 'Дорожная карта', 'ВАЗ 2101-07', '0', '210'),
(21, 'WK55/2', 'Фильтр топл. ', 'MANN-FILTER', 'CHEVROLET AVEO', '1', '249'),
(22, 'E17HD57', 'Фильтр масляный', 'HENGST FILTER', 'подбор авто', '1', '232'),
(23, 'WF8333', 'Фильтр топл.  ', 'WIX FILTERS', 'CHEVROLET AVEO', '0', '155'),
(24, 'WF8333', 'Фильтр топл.  ', 'WIX FILTERS', 'CHEVROLET AVEO', '1', '155'),
(25, 'MCM MK9062', 'комплект диск сц.', 'MECARM', 'ваз 2101-2107,2121', '0', '1400'),
(26, '7709GH', 'Цилиндр сцепл. главн', 'LPR', 'ВАЗ 2102-2106 ', '0', '500'),
(27, 'WL7083', 'Фильтр масляный', 'WIX FILTERS', 'ALFA ROMEO', '0', '120'),
(28, '2101-8101050', 'Радиатор отопителя', 'Дорожная карта', ' ВАЗ 2101-2107 &lt;ДК&gt;', '0', '330'),
(29, 'F508', 'Свеча зажигания ', 'Finwhale', 'ВАЗ 2108-2109 компл.4 шт', '0', '140'),
(30, '0242040502', 'Свеча зажигания ', 'BOSCH', 'ALFA ROMEO', '0', '200'),
(32, 'A11-8111210CA-KM', 'Ролик паразитный генератора', 'KIMIKO', 'Chery: Cross Eastar, Eastar, Elara, M11, Tioggo', '1', '329 '),
(34, '4PK1062', 'Ремень поликлиновой (Пр-во ContiTech)', 'Contitech', '', '1', '280'),
(35, 'RD.1430WL7134', 'Фильтр масляный', 'RIDER', 'MITSUBISHI LANCER, HONDA ACCORD, CIVIC ', '1', '77'),
(36, 'W610/3', 'Фильтр масляный', 'MANN-FILTER', 'подбор авто', '0', '192'),
(37, '0986452041', 'Фильтр масляный', 'BOSCH', 'HONDA, MITSUBISHI', '1', '152'),
(38, 'COF100128S', 'Фильтр масляный', 'CHAMPION', 'ALFA ROMEO,  FIAT /F128 ', '1', '136'),
(39, 'WL7134', 'Фильтр масляный ', 'WIX FILTERS', 'MAZDA, MITSUBISHI', '1', '103'),
(40, 'масло', '5w40', 'MATUL', 'бензи.,дизел., Д.В.С.', '26', '260'),
(41, 'ATF 1л', 'масло', 'Лукойл', 'Любое авто', '2', '115'),
(42, 'K-2', 'Очкститель системы охлаждения', 'prower max', 'Любое авто', '1', '330'),
(43, 'K-1', 'Очкститель системы охлаждения', 'prower max', 'Любое авто', '1', '280'),
(44, 'Gt11 1,5л', 'Антифриз концентрат', 'E-TEC', 'Любое авто', '8', '190'),
(45, 'Gt12 1,5л', 'Антифриз концентрат', 'E-TEC', 'Любое авто', '6', '210'),
(46, 'Тосол 10л', 'Тосол', 'Euro Плюс', 'Любое авто', '1', '400'),
(47, 'Тосол 9л', 'Тосол', 'ВАМП', 'Любое авто', '3', '535'),
(48, 'Незамерзайка -20, 4л', 'Стеклоомыватель Обзор', 'ВАМП', 'Любое авто', '3', '100'),
(49, '75w90, 4л', 'масло трансмисия', 'Лукойл', 'Любое авто', '1', '750'),
(50, '10w40 4л', 'масло', 'Heiix', 'Любое авто', '3', '765'),
(51, '5w30 4л', 'масло', 'Heiix', 'Любое авто', '2', '1065'),
(52, '5w40 1л', 'масло', 'Heiix', 'Любое авто', '2', '285'),
(53, '5w40 1л', 'масло', 'Heiix', 'Любое авто', '2', '285'),
(54, 'OC534', 'Фильтр масляный', 'KNECHT (MAHLE)', 'подбор авто', '2', '196'),
(57, 'BYDF31109132', 'Фильтр воздушный ', 'BYD китай', ' GEELY | EMGRAND EC7 ', '1', '100'),
(58, 'FA 1729', 'Фильтр воздушный ', 'Fusion', 'GEELY | EMGRAND EC7', '0', '120'),
(60, 'WK9022', 'Фильтр топливный', 'MANN-FILTER', 'RENAULT', '1', '1111'),
(61, 'WA6289', 'Фильтр воздушный ', 'WIX FILTERS', 'MAZDA 626, FORD USA', '1', '100'),
(62, 'WA6289', 'Фильтр воздушный ', 'WIX FILTERS', 'MAZDA 626, FORD USA', '1', '100'),
(63, 'OC384', 'Фильтр масляный VAZ 2101-9', 'KNECHT (MAHLE)', 'VAZ 2101-9', '1', '145'),
(64, 'W914/2', 'Фильтр масляный VAZ 2101-9', 'MANN-FILTER', 'VAZ 2101-9', '1', '165'),
(65, 'WA6395-12', 'Фильтр воздушный VAZ 2101-9', 'WIX', 'VAZ 2101-9', '0', '60'),
(66, 'WA6396-12', 'Фильтр воздушный VAZ 2101-9', 'WIX', 'VAZ 2101-9', '1', '65'),
(67, 'WL7168-12', 'Фильтр масляный VAZ 2101-9', 'WIX', 'VAZ 2101-9', '1', '75'),
(68, 'WA6290', 'Фильтр воздушный MAZDA 626', 'WIX FILTERS', 'MAZDA 626', '1', '176'),
(69, 'WF8130', 'Фильтр топливный диам. 6-8мм', 'WIX FILTERS', 'подбор авто', '2', '22'),
(70, 'RD.1340WA6290', 'Фильтр воздушный MAZDA 626 91-00', 'RIDER', 'MAZDA 626 91-00', '1', '105'),
(71, '0080.00', 'Колодка тормозные LADA 1200-1600 -84, 2101-2107 передн.', 'Remsa', ' LADA 1200-1600 -84, 2101-2107', '0', '330'),
(72, 'TF57', 'Фильтр масляный VAZ 2101-9', 'M-filter', 'VAZ 2101-9', '1', '100'),
(73, '081.3711', 'Фара VAZ 2108-09 лев.', 'Формула света', 'ВАЗ 2108,-09,-099', '1', '500'),
(75, '900 034', 'Пыльник аморт. компл. MAZDA задн.', 'SACHS', 'MAZDA	', '1', '350'),
(76, '21120-130101210', 'Радиатор вод. охлажд. ВАЗ 2110,-11,-12', 'ДААЗ', 'ВАЗ 2110,-11,-12', '0', '1200'),
(77, 'Gt12', 'Антифриз разливной', 'E-TEC', 'Любое авто', '95', '60'),
(78, 'OX78D', 'Фильтр масляный (мерседес ботинок, д.Чингиз )', 'KNECHT', 'MERCEDES-BENZ ', '0', '365'),
(80, '5364', 'Омыватель стекла зим. АЛЯSКА Фруктовый -20С 3л', 'АЛЯSКА', 'Любое авто', '0', '85'),
(81, '5361', 'Омыватель стекла зим. АЛЯSКА Ягодный -20С 3л', 'АЛЯSКА', 'Любое авто', '1', '85'),
(82, '4802648554', 'Омыватель стекла зим. Мaster cleaner -12 Цитрус 4л', 'Master cleaner', 'Любое авто', '2', '85'),
(83, '4802648555', 'Омыватель стекла зим. Мaster cleaner -12 Морск. бриз 4л', 'Master cleaner', 'Любое авто', '7', '100'),
(84, '4802666', 'Омыватель стекла зим. Мaster cleaner -20 Морск. бриз 4л', 'Master cleaner', 'Любое авто', '1', '85'),
(85, '6СТ-45 АЗ (1)', 'Аккумулятор 45Ah-12v C-CLASS ', 'Дорожная карта', 'подбор авто', '1', '1400'),
(89, 'P999-G12', 'Антифриз &lt;AXXIS&gt; RED концентрат G12+ (-80C) (Канистра 1,5л)', 'AXXIS Польша', 'Любое авто', '10', '200'),
(90, 'P999-GRN', 'Антифриз &lt;AXXIS&gt; GREEN концентрат G11 (-80C) (Канистра 1,5л)', 'AXXIS Польша', 'Любое авто', '2', '200'),
(91, '1987432190', 'Фильтр салона LEXUS, TOYOTA', 'BOSCH', 'TOYOTA CAMRY, LEXUS,  SUBARU,  DAIHATSU', '1', '250'),
(92, '1 987 947 745', 'Ремень ГАЗ-3302 Бизнес генератора дв. УМЗ-4216 ', 'BOSCH', 'TOYOTA  BMW  MAZDA  ВАЗ', '0', '155'),
(93, '1 987 947 648', 'Ремень клиновой 13x750 ', 'BOSCH', 'LANCIA  MERCEDES-BENZ  FIAT  IVECO  MITSUBISHI  NISSAN  HYUNDAI  MAZDA  DAIMLER  JAGUAR  PUCH  RENAULT', '0', '145'),
(94, '0242235666', 'Свеча зажигания FR7DCE 0.8 NICKEL (LADA, OPEL, FIAT) ', 'BOSCH', 'подбор авто', '4', '60'),
(95, 'Q20PRU#4', 'Свеча зажигания NICKEL ВАЗ 2110-2112', 'Denso', 'подбор авто', '4', '75'),
(97, 'V-LINE 12', 'Свеча зажигания BCPR6E ВАЗ 2110-2112', 'NGK', 'подбор авто', '4', '100'),
(98, 'ZFR6U9', 'Свеча зажигания CHEVROLET AVEO 1.4 08-, CRUZE 1.6-1.8 12', 'NGK', 'подбор авто', '4', '110'),
(99, 'ZFR6U9', 'Свеча зажигания CHEVROLET AVEO 1.4 08-, CRUZE 1.6-1.8 12', 'NGK', 'подбор авто', '4', '110'),
(100, 'V-LINE 2', 'Свеча зажигания 0.9 BPR6E ВАЗ 2108-099, DAEWOO LANOS 1.5', 'NGK', 'подбор авто', '4', '100'),
(102, 'Gt12+', 'Антифриз концентрат 4л', 'E-TEK CONCETRATE', 'подбор авто', '1', '560'),
(103, 'Gt12+', 'Антифриз концентрат 4л', 'E-TEK CONCETRATE', 'подбор авто', '1', '560'),
(104, 'NJ325', 'Сальник двигателя', 'PAYEN', 'MAZDA', '1', '150'),
(105, '610.022', 'Герметик DIRKO +300 для двигателя', 'Elring', 'подбор авто', '1', '600'),
(106, '107.270', 'Прокладка головки блока MAZDA 2.0TD RF 97', 'Elring', 'MAZDA', '1', '1500'),
(107, 'R336A.STD', 'Вкладыши шатунные Mazda F6,F8,R2,RF комплект', 'TAIHO', 'Mazda F6,F8,R2,RF', '1', '500'),
(108, '33760.050', 'Кольца MAZDA R2 d86.0+0.5 2.0-2.0-3.0 на 4цил. комплект', 'TP', 'MAZDA', '1', '3700'),
(109, 'AM 550', 'Паста для мытья рук Авто-мастер, банка 550г', 'Авто-мастер', 'Любое авто', '7', '15'),
(110, '33760.050', 'Кольца MAZDA R2 d86.0+0.5 2.0-2.0-3.0 на 4цил. комплект', 'TP', 'MAZDA', '1', '3700'),
(112, '022.160', 'Сальник двигателя N 30x44x7 MAZDA', 'Elring', 'MAZDA', '1', '250'),
(113, 'MV132', 'Сальник клапана (маслосемные колпачки) ', 'MUSASHI', 'MAZDA', '18', '25'),
(114, '0293.14', 'Колодка торм. NISSAN CUBE 1.5DCI 10-,TIIDA 1.5DCI-1.8 07-;SUZUKI SX4 06- передн. ', 'Remsa', 'NISSAN  JUKE (F15)  CUBE (Z12)  TEANA I (J31)  TEANA II (J32)', '1', '1500'),
(115, 'K9106', 'Фильтр салона NISSAN JUKE ', 'M-Filter', 'NISSAN JUKE ', '1', '200'),
(116, '053.3706', 'Распределитель зажигания ТАВРИЯ (ТРАМПЛЕР)', 'Дорожная карта', 'ТАВРИЯ', '1', '800'),
(121, '5W-40', 'Масло моторн. SHELL Helix HX8 SAE 5W-40 SN/CF (Канистра 1л)', 'Shell', 'подбор авто', '2', '300'),
(122, '10W-40', 'Масло моторн. SHELL Helix HX7 SAE 10W-40 4Л', 'Shell', 'подбор авто', '2', '1000'),
(123, '5W-30', 'Масло моторн. SHELL Helix HX8 SAE 5W-30 4Л', 'Shell', 'подбор авто', '3', '1200'),
(124, '5W-30', 'Масло моторн. SHELL Helix HX8 SAE 5W-30 4Л', 'Shell', 'подбор авто', '3', '1200'),
(125, 'Вода', 'Вода дистиллированная', 'OIL RIGHT', 'Любое авто', '5', '30'),
(126, '48021029826', 'Антифриз GREEN G11 Сoolant &lt;AXXIS&gt; (зеленый) (Канистра 10кг)', 'AXXIS Польша', 'Любое авто', '1', '600'),
(127, '5329', 'Омыватель стекла зим. АЛЯSКА -30 3л', 'АЛЯSКА', 'Любое авто', '1', '120'),
(128, '5360', 'Омыватель стекла зим. АЛЯSКА Ягодный -20С 5л', 'АЛЯSКА', 'Любое авто', '1', '150'),
(129, '4802617338', 'Омыватель стекла зимний бриз- 20 5л &lt;ДК&gt;', 'Дорожная карта', 'Любое авто', '1', '150'),
(130, '34522', 'Антифриз &lt;Гостовский&gt; зеленый 10л', 'Гостовский', 'Любое авто', '1', '500'),
(131, '245.1006040', 'Ремень 9,5х94х895 зубч. ГРМ ТАВРИЯ', 'БРТ', 'ЗАЗ', '1', '150'),
(132, 'RD-10-16/AT', 'Хомут затяжной нерж. 10-16мм.', 'RIDER', 'Любое авто', '5', '5'),
(133, 'RD-16-25/AT', 'Хомут затяжной нерж. 16-25мм.', 'RIDER', 'Любое авто', '5', '8'),
(134, 'AXXIS-G-5014(650)', 'Очиститель салона пенный 650ml &lt;AXXIS&gt;', 'AXXIS Польша', 'Любое авто', '1', '100'),
(135, 'AXXIS-G-5014(650)', 'Очиститель салона пенный 650ml &lt;AXXIS&gt;', 'AXXIS Польша', 'Любое авто', '1', '100'),
(136, 'RD-10P', 'Хомут пружинный d=10.8-11.9', 'RIDER', 'Любое авто', '5', '5'),
(137, 'RD-11P', 'Хомут пружинный d=11.9-13.1', 'RIDER', 'Любое авто', '5', '5'),
(138, 'RD-12P', 'Хомут пружинный d=13-14.3 ', 'RIDER', 'Любое авто', '5', '5'),
(139, 'RD-18P', 'Хомут пружинный d=19.4-21.4', 'RIDER', 'Любое авто', '5', '5'),
(140, 'RD-26P', 'Хомут пружинный d=29-31.5 ', 'RIDER', 'Любое авто', '5', '10'),
(141, '07030', 'Колодка торм. барабан. Nissan Almera N15/Sunny/Sentra 180X32 ', 'LPR', 'NISSAN  ALMERA I Hatchback (N15)  ALMERA I (N15)  SUNNY III (N14)  SUNNY III Hatchback (N14)  SUNNY III Liftback (N14)  100 NX (B13)', '1', '550'),
(142, 'DK-90-110', 'Хомут затяжной нерж. 90-110мм', 'Дорожная карта', 'Любое авто', '5', '15'),
(143, 'F501', 'Свеча зажигания ВАЗ 2101-2107 (компл.4 шт)', 'Finwhale', 'VAZ 2101-9', '1', '150'),
(144, 'COF100030S', 'Фильтр масляный двигателя ВАЗ 2101-2107 2108-09', 'CHAMPION', 'VAZ 2101-9', '1', '110'),
(145, '0684.02', 'Колодка торм. OPEL ASTRA G передн.', 'Remsa', 'OPEL  ASTRA G универсал (F35_)  ASTRA G Наклонная задняя часть (F48_, F08_)  ASTRA G седан (F69_)  ASTRA G кабрио (F67)  ASTRA G купе (F07_)  ASTRA G фургон (F70)  ASTRA F CLASSIC Наклонная задняя часть  ASTRA F CLASSIC седан  ASTRA F CLASSIC универс', '1', '1200'),
(146, '0876.01', 'Колодка торм. INFINITI FX, NISSAN X-TRAIL (T30) задн. ', 'Remsa', 'INFINITI FX, NISSAN X-TRAIL', '1', '950');

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `name` varchar(250) NOT NULL DEFAULT '',
  `login` varchar(50) NOT NULL DEFAULT '',
  `password` varchar(50) NOT NULL DEFAULT '',
  `lvl` int(11) NOT NULL DEFAULT '1'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id`, `name`, `login`, `password`, `lvl`) VALUES
(1, 'Admin', 'ba2018', 'a010c8cda66607c2a085751ade655925', 0),
(2, 'Worker', 'worker2018', '0ad387a259017dcdabd09c6980ed5375', 1);

-- --------------------------------------------------------

--
-- Структура таблицы `work`
--

CREATE TABLE `work` (
  `id` int(11) NOT NULL,
  `emp_id` int(11) NOT NULL,
  `cl_id` int(11) NOT NULL,
  `date_st` varchar(20) NOT NULL DEFAULT '',
  `date_fin` varchar(20) NOT NULL DEFAULT ''
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `work`
--

INSERT INTO `work` (`id`, `emp_id`, `cl_id`, `date_st`, `date_fin`) VALUES
(5, 5, 5, '2018-11-27', '2018-11-28'),
(6, 5, 6, '2018-11-28', '2018-11-28'),
(7, 5, 7, '2018-11-28', '2018-11-30'),
(8, 5, 8, '2018-11-30', '2018-11-30'),
(9, 5, 9, '2018-11-30', '2018-11-30'),
(10, 4, 10, '2018-11-30', '2018-11-30'),
(11, 5, 12, '2018-12-05', '2018-12-05'),
(12, 5, 13, '2018-12-07', '2018-12-07'),
(13, 6, 14, '2018-12-10', '2018-12-17'),
(14, 5, 15, '2018-12-10', '2018-12-12'),
(15, 5, 17, '2018-12-12', '2018-12-12'),
(17, 6, 18, '2018-12-18', '2018-12-18'),
(18, 5, 19, '2019-01-01', ''),
(19, 6, 21, '2019-01-08', '2019-01-08'),
(20, 5, 22, '2019-01-09', ''),
(21, 5, 20, '2019-01-11', ''),
(22, 5, 23, '2019-01-11', '');

-- --------------------------------------------------------

--
-- Структура таблицы `work_op`
--

CREATE TABLE `work_op` (
  `id` int(11) NOT NULL,
  `w_id` int(11) NOT NULL,
  `description` text NOT NULL,
  `cost` varchar(11) NOT NULL DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `work_op`
--

INSERT INTO `work_op` (`id`, `w_id`, `description`, `cost`) VALUES
(4, 1, 'Det 1(d0001) 10 по 170', '1700'),
(5, 1, 'gooood', '332'),
(6, 1, 'Det 1(d0001) 100 по 170', '17000'),
(7, 3, 'Det 1(d0001) 1 по 170', '170'),
(8, 3, 'замена шрус.', '700'),
(9, 4, 'зам. рычагов, шаравые, ступицп пра., колодки, масла 10W40.', '1000'),
(10, 4, 'Det 1(d0001) 4 по 170', '680'),
(11, 4, 'name123(x123123) 10 по 29', '290'),
(12, 4, 'Det 1(d0001)  по 170', '0'),
(13, 5, 'комплект диск сц.(MCM MK9062) 1 по 1400', '1400'),
(14, 5, 'Цилиндр сцепл. главн(7709GH) 1 по 500', '500'),
(15, 5, 'замена главнова цлиндра сц.\r\nзамена комплект диск сц.', '1500'),
(16, 6, 'замена антифриза, замена термостата ', '400'),
(17, 7, '10w40(масло) 5 по 94', '470'),
(18, 7, 'Фильтр масляный(WL7083) 1 по 120', '120'),
(19, 7, 'Фильтр масляный(WL7083) 1 по 120', '120'),
(20, 8, 'замена глв.цлин.сц', '750'),
(21, 10, 'очистка газамасленога канала', '300'),
(22, 7, 'замена свеч, катушки зажг.,масла', '450'),
(23, 7, 'Свеча зажигания (0242040502) 8 по 200', '1600'),
(24, 7, 'катушка', '900'),
(25, 9, 'система подачи тоалива', '300'),
(26, 11, '10w40(масло) 4 по 94', '376'),
(27, 11, 'Дорожная карта(Фильтр масляный) 1 по 100', '100'),
(28, 12, 'Фильтр топл.  (WF8333) 1 по 155', '155'),
(29, 12, 'Фильтр масляный(W610/3) 1 по 190', '190'),
(30, 12, 'замена масла, замена топленого фильтра, замена прокладки глуш.', '350'),
(31, 13, 'ремонт бампера ', ''),
(32, 14, 'дворник, аварика, ', ''),
(33, 14, '', '800'),
(34, 14, '', '800'),
(35, 13, '', '2500'),
(36, 15, 'замена сцпл. + салники каробки', '1200'),
(37, 16, 'зам. масла + фильтр,вазду. филтр. зад. бампер поставить на место. диаг. подвески.', ''),
(38, 16, 'зам. масла + фильтр,вазду. филтр. зад. бампер поставить на место. диаг. подвески.', ''),
(39, 16, '', ''),
(40, 17, '5w40(масло) 4 по 260', '1040'),
(41, 17, 'Фильтр воздушный (FA 1729) 1 по 120', '120'),
(42, 17, 'Фильтр масляный(OC534) 1 по 196', '196'),
(43, 17, '', ''),
(44, 13, '', ''),
(45, 13, '', ''),
(46, 18, 'РЕМОНТ ДВС ', ''),
(47, 19, 'Замена масла МКПП, замена масла двигателя', ''),
(48, 20, 'Радиатор вод. охлажд. ВАЗ 2110,-11,-12(21120-130101210) 1 по 1200', '1200'),
(49, 20, 'Антифриз разливной(Gt12) 5 по 60', '300'),
(50, 20, 'Замена Радиатора охлаждения, ремонт печки, ремонт дворников.', '550'),
(51, 20, '', ''),
(52, 21, 'Замена тормозного вакуума ', '400'),
(53, 21, '', ''),
(54, 22, '10w40(масло) 6 по 94', '564'),
(55, 22, 'Фильтр масляный (мерседес ботинок, д.Чингиз )(OX78D) 1 по 365', '365'),
(56, 22, '', ''),
(57, 22, 'Замена масла и Фильтра Двигателя', '');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `clients`
--
ALTER TABLE `clients`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `employee`
--
ALTER TABLE `employee`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `report`
--
ALTER TABLE `report`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `stock`
--
ALTER TABLE `stock`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `work`
--
ALTER TABLE `work`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `work_op`
--
ALTER TABLE `work_op`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `clients`
--
ALTER TABLE `clients`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=42;

--
-- AUTO_INCREMENT для таблицы `employee`
--
ALTER TABLE `employee`
  MODIFY `id` int(1) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT для таблицы `report`
--
ALTER TABLE `report`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=27;

--
-- AUTO_INCREMENT для таблицы `stock`
--
ALTER TABLE `stock`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=147;

--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT для таблицы `work`
--
ALTER TABLE `work`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=23;

--
-- AUTO_INCREMENT для таблицы `work_op`
--
ALTER TABLE `work_op`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=58;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
